app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    byebug
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-03-01 20:41:55.358284"], ["updated_at", "2017-03-01 20:41:55.358284"]]